In [3]:
import pandas as pd
import numpy as np

In [5]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
 "year": [2000, 2001, 2002, 2001, 2002, 2003],
 "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
 }
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [6]:
frame.loc[1]#rows selection by position

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

In [7]:
frame.iloc[2]

state    Ohio
year     2002
pop       3.6
Name: 2, dtype: object

In [8]:
frame['pop']=3#instead of scalar, iterable can be used to assign different values

In [9]:
frame

    state  year  pop
0    Ohio  2000    3
1    Ohio  2001    3
2    Ohio  2002    3
3  Nevada  2001    3
4  Nevada  2002    3
5  Nevada  2003    3

In [10]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [11]:
frame.to_dict()

{'state': {0: 'Ohio',
  1: 'Ohio',
  2: 'Ohio',
  3: 'Nevada',
  4: 'Nevada',
  5: 'Nevada'},
 'year': {0: 2000, 1: 2001, 2: 2002, 3: 2001, 4: 2002, 5: 2003},
 'pop': {0: 3, 1: 3, 2: 3, 3: 3, 4: 3, 5: 3}}

In [12]:
frame.to_numpy()

array([['Ohio', 2000, 3],
       ['Ohio', 2001, 3],
       ['Ohio', 2002, 3],
       ['Nevada', 2001, 3],
       ['Nevada', 2002, 3],
       ['Nevada', 2003, 3]], dtype=object)